_org/_posts/2012-12-20-4clojure_solutions.org
#+BEGIN_HTML
---
layout: post
title: 4clojure's elementary and easy solutions
tags: [pl]
---
#+END_HTML
学clojure玩,就跌跌撞撞把4clojure上的elementary和easy的题目都写完了,没错,柿子就是要捡软的捏,目前依然任重道远......做这个才真正知道什么叫做行百里者半九十.

很多代码屎一般,因为实在不熟悉语言.自己除了括号就知道map和reduce两个东西.看着别人高富帅的代码顿时自己缩小了一万倍.性能什么的都不在考虑范围内,解决问题才是关键.这又让自己回想起了刚看的一篇有关目标的短文,忘了在哪看的了,说的就是定目标其实也有缺点的,比如不择手段啊,十分功利啊......都是需要克服才能发挥更好作用的.

#+BEGIN_SRC clojure
;;1
true

;;2
4

;;3
"HELLO WORLD"

;;4
:a :b :c

;;5
'(1 2 3 4)
'(1 2 3 4)

;;6
:a :b :c

;;7
[1 2 3 4]
[1 2 3 4]

;;8
(set '(:a :b :c :d))
(set '(:a :b :c :d))

;;9
2

;;10
20
20

;;11
[:b 2]

;;12
3
3
3

;;13
[20 30 40]

;;14
8

;;15
