_orgs/2012-12-21-4clojure_solutions.html
         containsk <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">contains?</span> m k<span style="color: #7f7f7f;">)</span>]
     <span style="color: #7f7f7f;">(</span><span style="color: #FBDE2D;">if</span> containsk
         <span style="color: #7f7f7f;">(</span><span style="color: #FBDE2D;">if</span> <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">=</span> v nil<span style="color: #7f7f7f;">)</span>
           true
           false
         <span style="color: #7f7f7f;">)</span>
         false<span style="color: #7f7f7f;">)))</span>

 <span style="color: #8B8989; font-style: italic;">;;</span><span style="color: #8B8989; font-style: italic;">145</span>
 '<span style="color: #7f7f7f;">(</span>1 5 9 13 17 21 25 29 33 37<span style="color: #7f7f7f;">)</span>

 <span style="color: #8B8989; font-style: italic;">;;</span><span style="color: #8B8989; font-style: italic;">162</span>
 1

 <span style="color: #8B8989; font-style: italic;">;;</span><span style="color: #8B8989; font-style: italic;">161</span>
 #{1 2}

 <span style="color: #8B8989; font-style: italic;">;;</span><span style="color: #8B8989; font-style: italic;">156</span>
 #<span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">reduce</span> (fn [m v]
             <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">assoc</span> m v %1<span style="color: #7f7f7f;">))</span>
         {} %2<span style="color: #7f7f7f;">)</span>

 <span style="color: #8B8989; font-style: italic;">;;</span><span style="color: #8B8989; font-style: italic;">166</span>
 (fn [op x y] <span style="color: #7f7f7f;">(</span><span style="color: #FBDE2D;">cond</span> <span style="color: #7f7f7f;">(</span>op x y<span style="color: #7f7f7f;">)</span> <span style="color: #4c83ff;">:lt</span> <span style="color: #7f7f7f;">(</span>op y x<span style="color: #7f7f7f;">)</span> <span style="color: #4c83ff;">:gt</span> <span style="color: #4c83ff;">:else</span> <span style="color: #4c83ff;">:eq</span><span style="color: #7f7f7f;">))</span>

 <span style="color: #8B8989; font-style: italic;">;;</span><span style="color: #8B8989; font-style: italic;">19</span>
 (fn [x] <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">nth</span> x <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">-</span> <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">count</span> x<span style="color: #7f7f7f;">)</span> 1<span style="color: #7f7f7f;">)))</span>

 <span style="color: #8B8989; font-style: italic;">;;</span><span style="color: #8B8989; font-style: italic;">20</span>
 (fn [x] <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">nth</span> x <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">-</span> <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">count</span> x<span style="color: #7f7f7f;">)</span> 2<span style="color: #7f7f7f;">)))</span>

 <span style="color: #8B8989; font-style: italic;">;;</span><span style="color: #8B8989; font-style: italic;">21</span>
 (fn [l, n] 
   <span style="color: #7f7f7f;">(</span><span style="color: #FBDE2D;">loop</span> [n n
       l l]
     <span style="color: #7f7f7f;">(</span><span style="color: #FBDE2D;">if</span> <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">=</span> n 0<span style="color: #7f7f7f;">)</span>
         <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">first</span> l<span style="color: #7f7f7f;">)</span>
         <span style="color: #7f7f7f;">(</span><span style="color: #FBDE2D;">recur</span> <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">dec</span> n<span style="color: #7f7f7f;">)(</span><span style="color: #FF6400;">next</span> l<span style="color: #7f7f7f;">)))))</span>

 <span style="color: #8B8989; font-style: italic;">;;</span><span style="color: #8B8989; font-style: italic;">22</span>
 #<span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">reduce</span> + <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">map</span> (fn [x] 1<span style="color: #7f7f7f;">)</span> %<span style="color: #7f7f7f;">))</span>

 <span style="color: #8B8989; font-style: italic;">;;</span><span style="color: #8B8989; font-style: italic;">24</span>
 #<span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">reduce</span> + %<span style="color: #7f7f7f;">)</span>

 <span style="color: #8B8989; font-style: italic;">;;</span><span style="color: #8B8989; font-style: italic;">25</span>
 #<span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">filter</span> odd? %<span style="color: #7f7f7f;">)</span>

 <span style="color: #8B8989; font-style: italic;">;;</span><span style="color: #8B8989; font-style: italic;">23</span>
 #<span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">reduce</span> conj <span style="color: #7f7f7f;">()</span> %<span style="color: #7f7f7f;">)</span>

 <span style="color: #8B8989; font-style: italic;">;;</span><span style="color: #8B8989; font-style: italic;">27</span>
 (fn [coll]
   <span style="color: #7f7f7f;">(</span><span style="color: #FBDE2D;">let</span> [rc <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">reverse</span> coll<span style="color: #7f7f7f;">)</span> n <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">count</span> coll<span style="color: #7f7f7f;">)</span>]
     <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">every?</span> identity 
       <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">map</span> #<span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">=</span> <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">nth</span> coll %<span style="color: #7f7f7f;">)</span> <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">nth</span> rc %<span style="color: #7f7f7f;">))</span> <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">range</span> <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">/</span> <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">dec</span> n<span style="color: #7f7f7f;">)</span> 2<span style="color: #7f7f7f;">))))))</span>

 <span style="color: #8B8989; font-style: italic;">;;</span><span style="color: #8B8989; font-style: italic;">26</span>
 (fn [x]
   <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">take</span> x
     <span style="color: #7f7f7f;">(</span>(fn fib [a b]
         <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">cons</span> a <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">lazy-seq</span> <span style="color: #7f7f7f;">(</span>fib b <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">+</span> a b<span style="color: #7f7f7f;">)))))</span> 
       1 1<span style="color: #7f7f7f;">)))</span>

 <span style="color: #8B8989; font-style: italic;">;;</span><span style="color: #8B8989; font-style: italic;">38</span>
 (fn [&amp; l]
     <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">reduce</span> (fn [x,y] <span style="color: #7f7f7f;">(</span><span style="color: #FBDE2D;">if</span> <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">&gt;</span> x y<span style="color: #7f7f7f;">)</span> x y<span style="color: #7f7f7f;">))</span> l <span style="color: #7f7f7f;">))</span>

 <span style="color: #8B8989; font-style: italic;">;;</span><span style="color: #8B8989; font-style: italic;">29</span>
 #<span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">apply</span> str <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">re-seq</span> #<span style="color: #61CE3C;">"[A-Z]+"</span> %<span style="color: #7f7f7f;">))</span>

 <span style="color: #8B8989; font-style: italic;">;;</span><span style="color: #8B8989; font-style: italic;">48</span>
 6

 <span style="color: #8B8989; font-style: italic;">;;</span><span style="color: #8B8989; font-style: italic;">32</span>
 reduce #<span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">conj</span> %1 %2 %2<span style="color: #7f7f7f;">)</span> []

 <span style="color: #8B8989; font-style: italic;">;;</span><span style="color: #8B8989; font-style: italic;">34</span>
 (fn [s e]
   <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">take</span> <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">-</span> e s<span style="color: #7f7f7f;">)</span> <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">iterate</span> inc s<span style="color: #7f7f7f;">)))</span>

 <span style="color: #8B8989; font-style: italic;">;;</span><span style="color: #8B8989; font-style: italic;">42</span>
 #<span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">apply</span> * <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">range</span> 1 <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">inc</span> %<span style="color: #7f7f7f;">)))</span>

 <span style="color: #8B8989; font-style: italic;">;;</span><span style="color: #8B8989; font-style: italic;">47</span>
 4

 <span style="color: #8B8989; font-style: italic;">;;</span><span style="color: #8B8989; font-style: italic;">45</span>
 '<span style="color: #7f7f7f;">(</span>1 4 7 10 13<span style="color: #7f7f7f;">)</span>

 <span style="color: #8B8989; font-style: italic;">;;</span><span style="color: #8B8989; font-style: italic;">28</span>
 (fn[x]
   <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">filter</span> <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">complement</span> sequential?<span style="color: #7f7f7f;">)</span>
           <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">rest</span> <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">tree-seq</span> sequential? seq x<span style="color: #7f7f7f;">))))</span>

 <span style="color: #8B8989; font-style: italic;">;;</span><span style="color: #8B8989; font-style: italic;">30</span>
 (fn xxxx[x]
   <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">reverse</span>
   <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">reduce</span> (fn [a b]
             <span style="color: #7f7f7f;">(</span><span style="color: #FBDE2D;">if</span> <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">not</span> <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">=</span> <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">first</span> a<span style="color: #7f7f7f;">)</span> b<span style="color: #7f7f7f;">))</span>
               <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">conj</span> a b<span style="color: #7f7f7f;">)</span>
               a<span style="color: #7f7f7f;">)</span>
             <span style="color: #7f7f7f;">)</span>
           <span style="color: #7f7f7f;">()</span>
           x<span style="color: #7f7f7f;">)))</span>

 <span style="color: #8B8989; font-style: italic;">;;</span><span style="color: #8B8989; font-style: italic;">39</span>
 (fn [x y] <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">mapcat</span> #<span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">list</span> %1 %2<span style="color: #7f7f7f;">)</span> x y<span style="color: #7f7f7f;">))</span>

 <span style="color: #8B8989; font-style: italic;">;;</span><span style="color: #8B8989; font-style: italic;">33</span>
 (fn replicates [l n]
   <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">reverse</span>
   <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">reduce</span> (fn [x y] <span style="color: #7f7f7f;">(</span>
                       into x <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">repeat</span> n y<span style="color: #7f7f7f;">)</span> 
                       <span style="color: #7f7f7f;">))</span> <span style="color: #7f7f7f;">()</span> l<span style="color: #7f7f7f;">)))</span>

 <span style="color: #8B8989; font-style: italic;">;;</span><span style="color: #8B8989; font-style: italic;">40</span>
 (fn [se l]<span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">rest</span>
                         <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">mapcat</span> #<span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">list</span> se %<span style="color: #7f7f7f;">)</span> l
                         <span style="color: #7f7f7f;">)</span>
                         <span style="color: #7f7f7f;">))</span>

 <span style="color: #8B8989; font-style: italic;">;;</span><span style="color: #8B8989; font-style: italic;">31</span>
 (fn cap[l]
   <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">reverse</span>
   <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">reduce</span> (fn [x y]
             <span style="color: #8B8989; font-style: italic;">;</span><span style="color: #8B8989; font-style: italic;">(println (first (first x)) (next x) y) </span>
             <span style="color: #7f7f7f;">(</span><span style="color: #FBDE2D;">if</span> <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">=</span> <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">first</span> <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">first</span> x<span style="color: #7f7f7f;">))</span> y<span style="color: #7f7f7f;">)</span>
               <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">conj</span> <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">next</span> x<span style="color: #7f7f7f;">)</span> <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">conj</span> <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">first</span> x<span style="color: #7f7f7f;">)</span> y<span style="color: #7f7f7f;">))</span>
               <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">conj</span> x <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">list</span> y<span style="color: #7f7f7f;">))</span>
               <span style="color: #7f7f7f;">)</span>
             <span style="color: #7f7f7f;">)</span> 
           <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">list</span> <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">list</span> <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">first</span> l<span style="color: #7f7f7f;">)))</span> 
           <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">next</span> l<span style="color: #7f7f7f;">)</span>
   <span style="color: #7f7f7f;">)))</span>

 <span style="color: #8B8989; font-style: italic;">;;</span><span style="color: #8B8989; font-style: italic;">52</span>
 [c e]

 <span style="color: #8B8989; font-style: italic;">;;</span><span style="color: #8B8989; font-style: italic;">41</span>
 (fn asdf
   [coll n]
   <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">mapcat</span> #<span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">take</span> <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">dec</span> n<span style="color: #7f7f7f;">)</span> %<span style="color: #7f7f7f;">)</span> <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">partition-all</span> n coll<span style="color: #7f7f7f;">))</span>
   <span style="color: #7f7f7f;">)</span>

 <span style="color: #8B8989; font-style: italic;">;;</span><span style="color: #8B8989; font-style: italic;">49</span>
 #<span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">list</span> <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">take</span> %1 %2<span style="color: #7f7f7f;">)</span>
 <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">drop</span> %1 %2<span style="color: #7f7f7f;">))</span>

 <span style="color: #8B8989; font-style: italic;">;;</span><span style="color: #8B8989; font-style: italic;">51</span>
 <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">list</span> 1 2 3 4 5<span style="color: #7f7f7f;">)</span>

 <span style="color: #8B8989; font-style: italic;">;;</span><span style="color: #8B8989; font-style: italic;">83</span>
 (fn [&amp; args]
             <span style="color: #7f7f7f;">(</span><span style="color: #FBDE2D;">let</span> [n <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">reduce</span> #<span style="color: #7f7f7f;">(</span><span style="color: #FBDE2D;">if</span> <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">=</span> true %2<span style="color: #7f7f7f;">)</span>
                                <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">+</span> 1 %1<span style="color: #7f7f7f;">)</span>
                                %1<span style="color: #7f7f7f;">)</span> 0 args<span style="color: #7f7f7f;">)</span>]
               <span style="color: #7f7f7f;">(</span><span style="color: #FBDE2D;">and</span> <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">&gt;</span> n 0<span style="color: #7f7f7f;">)</span>
                    <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">&lt;</span> n <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">count</span> args<span style="color: #7f7f7f;">)))))</span>

 <span style="color: #8B8989; font-style: italic;">;;</span><span style="color: #8B8989; font-style: italic;">61</span>
 (fn  
   [keys vals]
     <span style="color: #7f7f7f;">(</span><span style="color: #FBDE2D;">loop</span> [map {}
            ks <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">seq</span> keys<span style="color: #7f7f7f;">)</span>
            vs <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">seq</span> vals<span style="color: #7f7f7f;">)</span>]
       <span style="color: #7f7f7f;">(</span><span style="color: #FBDE2D;">if</span> <span style="color: #7f7f7f;">(</span><span style="color: #FBDE2D;">and</span> ks vs<span style="color: #7f7f7f;">)</span>
         <span style="color: #7f7f7f;">(</span><span style="color: #FBDE2D;">recur</span> <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">assoc</span> map <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">first</span> ks<span style="color: #7f7f7f;">)</span> <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">first</span> vs<span style="color: #7f7f7f;">))</span>
                <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">next</span> ks<span style="color: #7f7f7f;">)</span>
                <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">next</span> vs<span style="color: #7f7f7f;">))</span>
         map<span style="color: #7f7f7f;">)))</span>

 <span style="color: #8B8989; font-style: italic;">;;</span><span style="color: #8B8989; font-style: italic;">66</span>
 (fn [a b]                                                  
   <span style="color: #7f7f7f;">(</span><span style="color: #FBDE2D;">loop</span> [x <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">min</span> a b<span style="color: #7f7f7f;">)</span>]                                            
     <span style="color: #7f7f7f;">(</span><span style="color: #FBDE2D;">if</span> <span style="color: #7f7f7f;">(</span><span style="color: #FBDE2D;">or</span> <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">not=</span> 0 <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">mod</span> b x<span style="color: #7f7f7f;">))</span> <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">not=</span> 0 <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">mod</span> a x<span style="color: #7f7f7f;">)))</span>             
       <span style="color: #7f7f7f;">(</span><span style="color: #FBDE2D;">do</span>                                                        
         <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">println</span> x<span style="color: #7f7f7f;">)</span>                                             
         <span style="color: #7f7f7f;">(</span><span style="color: #FBDE2D;">recur</span> <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">-</span> x 1<span style="color: #7f7f7f;">)))</span>                                        
       x<span style="color: #7f7f7f;">)))</span>

 <span style="color: #8B8989; font-style: italic;">;;</span><span style="color: #8B8989; font-style: italic;">81</span>
 (fn [s1 s2]
   <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">reduce</span> #<span style="color: #7f7f7f;">(</span><span style="color: #FBDE2D;">if</span> <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">nil?</span> <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">get</span> s2 %2<span style="color: #7f7f7f;">))</span>
              %1
              <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">conj</span> %1 %2<span style="color: #7f7f7f;">))</span>
           #{} s1<span style="color: #7f7f7f;">))</span>

 <span style="color: #8B8989; font-style: italic;">;;</span><span style="color: #8B8989; font-style: italic;">62</span>
 (fn iter [f x]
   <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">cons</span> x <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">lazy-seq</span> <span style="color: #7f7f7f;">(</span>iter f <span style="color: #7f7f7f;">(</span>f x<span style="color: #7f7f7f;">)))))</span>

 <span style="color: #8B8989; font-style: italic;">;;</span><span style="color: #8B8989; font-style: italic;">107</span>
 (fn[n] #<span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">int</span> <span style="color: #7f7f7f;">(</span><span style="color: #919191;">Math/pow</span> %1 n<span style="color: #7f7f7f;">)))</span>

 <span style="color: #8B8989; font-style: italic;">;;</span><span style="color: #8B8989; font-style: italic;">99</span>
 (fn [a b] <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">map</span> #<span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">-</span> <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">int</span> %<span style="color: #7f7f7f;">)</span> 48<span style="color: #7f7f7f;">)</span> <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">seq</span> <span style="color: #7f7f7f;">(</span><span style="color: #919191;">String/valueOf</span> <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">*</span> a b<span style="color: #7f7f7f;">)))))</span>

 <span style="color: #8B8989; font-style: italic;">;;</span><span style="color: #8B8989; font-style: italic;">90</span>
 (fn [a b]
   <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">set</span> <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">mapcat</span> #<span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">map</span>
                  (fn [x]
                    <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">list</span> x %<span style="color: #7f7f7f;">))</span> a<span style="color: #7f7f7f;">)</span>
                b<span style="color: #7f7f7f;">)))</span>

 <span style="color: #8B8989; font-style: italic;">;;</span><span style="color: #8B8989; font-style: italic;">63</span>
 (fn
   [f coll]
   <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">persistent!</span>
    <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">reduce</span>
     (fn [ret x]
       <span style="color: #7f7f7f;">(</span><span style="color: #FBDE2D;">let</span> [k <span style="color: #7f7f7f;">(</span>f x<span style="color: #7f7f7f;">)</span>]
         <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">assoc!</span> ret k <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">conj</span> <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">get</span> ret k []<span style="color: #7f7f7f;">)</span> x<span style="color: #7f7f7f;">))))</span>
     <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">transient</span> {}<span style="color: #7f7f7f;">)</span>
     coll<span style="color: #7f7f7f;">)))</span>

 <span style="color: #8B8989; font-style: italic;">;;</span><span style="color: #8B8989; font-style: italic;">88</span>
 (fn __ [a b]
   <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">reduce</span> #<span style="color: #7f7f7f;">(</span><span style="color: #FBDE2D;">if</span> <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">contains?</span> %1 %2<span style="color: #7f7f7f;">)</span>
              <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">disj</span> %1 %2<span style="color: #7f7f7f;">)</span>
              <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">conj</span> %1 %2<span style="color: #7f7f7f;">))</span>
           a
           b<span style="color: #7f7f7f;">))</span>

 <span style="color: #8B8989; font-style: italic;">;;</span><span style="color: #8B8989; font-style: italic;">122</span>
 (fn [s]
   <span style="color: #7f7f7f;">(</span><span style="color: #919191;">Integer/parseInt</span> s 2<span style="color: #7f7f7f;">))</span>

 <span style="color: #8B8989; font-style: italic;">;;</span><span style="color: #8B8989; font-style: italic;">126</span>
 <span style="color: #919191;">Class</span>

 <span style="color: #8B8989; font-style: italic;">;;</span><span style="color: #8B8989; font-style: italic;">143</span>
 (fn [a b]
    <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">apply</span> + <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">map</span> * a b<span style="color: #7f7f7f;">)))</span>

 <span style="color: #8B8989; font-style: italic;">;;</span><span style="color: #8B8989; font-style: italic;">97</span>
 (fn pascal [n]
   <span style="color: #7f7f7f;">(</span><span style="color: #FBDE2D;">if</span> <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">=</span> n 1<span style="color: #7f7f7f;">)</span>
     [1]
     <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">map</span> #<span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">apply</span> + %<span style="color: #7f7f7f;">)</span>
       <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">partition</span> 2 1
         <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">concat</span> [0] <span style="color: #7f7f7f;">(</span>pascal <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">-</span> n 1<span style="color: #7f7f7f;">))</span> [0]<span style="color: #7f7f7f;">)))))</span>

 <span style="color: #8B8989; font-style: italic;">;;</span><span style="color: #8B8989; font-style: italic;">135</span>
 (fn __ [&amp; l]
   <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">reduce</span> #<span style="color: #7f7f7f;">(</span><span style="color: #FBDE2D;">if</span> <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">number?</span> %2<span style="color: #7f7f7f;">)</span>
              <span style="color: #7f7f7f;">(</span>%1 %2<span style="color: #7f7f7f;">)</span>
              (fn [i]
                <span style="color: #7f7f7f;">(</span>%2 %1 i<span style="color: #7f7f7f;">))</span>
              <span style="color: #7f7f7f;">)</span>
           l<span style="color: #7f7f7f;">))</span>

 <span style="color: #8B8989; font-style: italic;">;;</span><span style="color: #8B8989; font-style: italic;">95</span>
 (fn __ [tree]
   <span style="color: #7f7f7f;">(</span><span style="color: #FBDE2D;">if</span> <span style="color: #7f7f7f;">(</span><span style="color: #FBDE2D;">and</span> <span style="color: #7f7f7f;">(</span><span style="color: #FBDE2D;">or</span> <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">vector?</span> tree<span style="color: #7f7f7f;">)</span>
                <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">seq?</span> tree<span style="color: #7f7f7f;">))</span>
            <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">=</span> <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">count</span> tree<span style="color: #7f7f7f;">)</span> 3<span style="color: #7f7f7f;">))</span>
     <span style="color: #7f7f7f;">(</span><span style="color: #FBDE2D;">and</span> <span style="color: #7f7f7f;">(</span>__ <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">second</span> tree<span style="color: #7f7f7f;">))</span> <span style="color: #7f7f7f;">(</span>__ <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">second</span> <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">rest</span> tree<span style="color: #7f7f7f;">))))</span>
     <span style="color: #7f7f7f;">(</span><span style="color: #FBDE2D;">if</span> <span style="color: #7f7f7f;">(</span><span style="color: #FBDE2D;">and</span> <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">not</span> <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">vector?</span> tree<span style="color: #7f7f7f;">))</span> <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">not</span> <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">seq?</span> tree<span style="color: #7f7f7f;">)))</span>
       <span style="color: #7f7f7f;">(</span><span style="color: #FBDE2D;">if</span> <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">=</span> false tree<span style="color: #7f7f7f;">)</span>
         false
         true<span style="color: #7f7f7f;">)</span>
       false
       <span style="color: #7f7f7f;">)))</span>

 <span style="color: #8B8989; font-style: italic;">;;</span><span style="color: #8B8989; font-style: italic;">118</span>
 (fn mymap [f coll]
   <span style="color: #7f7f7f;">(</span><span style="color: #FBDE2D;">if</span> <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">false?</span> <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">empty?</span> coll<span style="color: #7f7f7f;">))</span>
         <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">lazy-seq</span>
           <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">cons</span> <span style="color: #7f7f7f;">(</span>f <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">first</span> coll<span style="color: #7f7f7f;">))</span> <span style="color: #7f7f7f;">(</span>mymap f <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">rest</span> coll<span style="color: #7f7f7f;">))))))</span>

 <span style="color: #8B8989; font-style: italic;">;;</span><span style="color: #8B8989; font-style: italic;">120</span>
 (fn __ [l]
   <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">reduce</span> 
    (fn inside-reduce [a b]
   <span style="color: #7f7f7f;">(</span><span style="color: #FBDE2D;">if</span> <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">&lt;</span> b <span style="color: #7f7f7f;">(</span>(fn sum_square [l]
   <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">reduce</span> #<span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">+</span> %1 <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">*</span> %2 %2<span style="color: #7f7f7f;">))</span>
           0
           l<span style="color: #7f7f7f;">))</span> <span style="color: #7f7f7f;">(</span>(fn seq_number [n]
   <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">map</span> #<span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">-</span> <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">int</span> %<span style="color: #7f7f7f;">)</span> 48<span style="color: #7f7f7f;">)</span>
        <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">seq</span> <span style="color: #7f7f7f;">(</span><span style="color: #919191;">String/valueOf</span> n<span style="color: #7f7f7f;">))))</span> b<span style="color: #7f7f7f;">)))</span>
     <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">+</span> a 1<span style="color: #7f7f7f;">)</span>
     a<span style="color: #7f7f7f;">))</span>

           0
           l<span style="color: #7f7f7f;">))</span>

 <span style="color: #8B8989; font-style: italic;">;;</span><span style="color: #8B8989; font-style: italic;">128</span>
 (fn __ [s]
   <span style="color: #7f7f7f;">(</span><span style="color: #FBDE2D;">let</span> [suit-table {<span style="color: #61CE3C;">"D"</span> <span style="color: #4c83ff;">:diamond</span>, <span style="color: #61CE3C;">"H"</span> <span style="color: #4c83ff;">:heart</span>, <span style="color: #61CE3C;">"C"</span> <span style="color: #4c83ff;">:club</span>, <span style="color: #61CE3C;">"S"</span> <span style="color: #4c83ff;">:spades</span>}
         rank-table {<span style="color: #61CE3C;">"A"</span> 12,
                     <span style="color: #61CE3C;">"K"</span> 11,
                     <span style="color: #61CE3C;">"Q"</span> 10,
                     <span style="color: #61CE3C;">"J"</span> 9,
                     <span style="color: #61CE3C;">"T"</span> 8,
                     <span style="color: #61CE3C;">"9"</span> 7,
                     <span style="color: #61CE3C;">"8"</span> 6,
                     <span style="color: #61CE3C;">"7"</span> 5,
                     <span style="color: #61CE3C;">"6"</span> 4,
                     <span style="color: #61CE3C;">"5"</span> 3,
                     <span style="color: #61CE3C;">"4"</span> 2,
                     <span style="color: #61CE3C;">"3"</span> 1,
                     <span style="color: #61CE3C;">"2"</span> 0}
         ss <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">seq</span> s<span style="color: #7f7f7f;">)</span>]
     <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">println</span> <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">first</span> ss<span style="color: #7f7f7f;">)</span>
              <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">second</span> ss<span style="color: #7f7f7f;">))</span>
     <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">assoc</span> {}
       <span style="color: #4c83ff;">:suit</span> <span style="color: #7f7f7f;">(</span>suit-table <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">str</span> <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">first</span> ss<span style="color: #7f7f7f;">)))</span>
       <span style="color: #4c83ff;">:rank</span> <span style="color: #7f7f7f;">(</span>rank-table <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">str</span> <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">second</span> ss<span style="color: #7f7f7f;">))))))</span>

 <span style="color: #8B8989; font-style: italic;">;;</span><span style="color: #8B8989; font-style: italic;">100</span>
 (fn __ [&amp; args] 
   <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">reduce</span> (fn lcm [a b]
             <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">/</span>  <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">*</span> a b<span style="color: #7f7f7f;">)(</span>(fn gcd [a b]
                           <span style="color: #7f7f7f;">(</span><span style="color: #FBDE2D;">if</span> <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">=</span> b 0<span style="color: #7f7f7f;">)</span>
                             a
                             <span style="color: #7f7f7f;">(</span>gcd b <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">mod</span> a b<span style="color: #7f7f7f;">))))</span> a b<span style="color: #7f7f7f;">)</span> <span style="color: #7f7f7f;">))</span>
           args<span style="color: #7f7f7f;">))</span>

 <span style="color: #8B8989; font-style: italic;">;;</span><span style="color: #8B8989; font-style: italic;">157</span>
 (fn __[coll]
   <span style="color: #7f7f7f;">(</span><span style="color: #FBDE2D;">loop</span> [x <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">-</span> <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">count</span> coll<span style="color: #7f7f7f;">)</span> 1<span style="color: #7f7f7f;">)</span>
          l []]
     <span style="color: #7f7f7f;">(</span><span style="color: #FBDE2D;">if</span> <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">&gt;=</span> x 0<span style="color: #7f7f7f;">)</span>
       <span style="color: #7f7f7f;">(</span><span style="color: #FBDE2D;">recur</span> <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">-</span> x 1<span style="color: #7f7f7f;">)</span>
              <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">conj</span> l <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">list</span> <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">nth</span> coll x<span style="color: #7f7f7f;">)</span> x<span style="color: #7f7f7f;">)))</span>
       <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">reverse</span> l<span style="color: #7f7f7f;">)</span>
     <span style="color: #7f7f7f;">)))</span>

 <span style="color: #8B8989; font-style: italic;">;;</span><span style="color: #8B8989; font-style: italic;">96</span>
 (fn __ [tree]
   <span style="color: #7f7f7f;">(</span><span style="color: #FBDE2D;">let</span> [[v l r] tree]
     <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">=</span> l <span style="color: #7f7f7f;">(</span>(fn reflect [tree]
             <span style="color: #7f7f7f;">(</span><span style="color: #FBDE2D;">if</span> <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">nil?</span> tree<span style="color: #7f7f7f;">)</span>
               tree
               <span style="color: #7f7f7f;">(</span><span style="color: #FBDE2D;">let</span> [[v l r] tree]
                 <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">list</span> v <span style="color: #7f7f7f;">(</span>reflect r<span style="color: #7f7f7f;">)</span> <span style="color: #7f7f7f;">(</span>reflect l<span style="color: #7f7f7f;">)))))</span>
           r<span style="color: #7f7f7f;">))))</span>

 <span style="color: #8B8989; font-style: italic;">;;</span><span style="color: #8B8989; font-style: italic;">147</span>
 (fn __ [coll]
   <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">cons</span> coll <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">lazy-seq</span> <span style="color: #7f7f7f;">(</span>__ <span style="color: #7f7f7f;">(</span>(fn next-pacscal [coll]
     <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">conj</span> <span style="color: #7f7f7f;">(</span><span style="color: #FBDE2D;">loop</span> [length <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">-</span> <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">count</span> coll<span style="color: #7f7f7f;">)</span> 1<span style="color: #7f7f7f;">)</span> 
                  i 0
                  l [<span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">first</span> coll<span style="color: #7f7f7f;">)</span>]]
             <span style="color: #7f7f7f;">(</span><span style="color: #FBDE2D;">if</span> <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">&lt;</span> i length<span style="color: #7f7f7f;">)</span>
               <span style="color: #7f7f7f;">(</span><span style="color: #FBDE2D;">recur</span>
                length
                <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">inc</span> i<span style="color: #7f7f7f;">)</span>
                <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">conj</span> l <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">bigint</span> <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">+</span> <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">nth</span>  coll i<span style="color: #7f7f7f;">)</span> <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">nth</span> coll <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">inc</span> i<span style="color: #7f7f7f;">))))))</span>
               l<span style="color: #7f7f7f;">))</span>
           <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">last</span> coll<span style="color: #7f7f7f;">)))</span> coll <span style="color: #7f7f7f;">))</span> <span style="color: #7f7f7f;">)</span> <span style="color: #7f7f7f;">))</span>

 <span style="color: #8B8989; font-style: italic;">;;</span><span style="color: #8B8989; font-style: italic;">146</span>
 #<span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">reduce</span> (fn [a b]<span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">assoc</span> a <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">first</span> b<span style="color: #7f7f7f;">)</span> <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">second</span> b<span style="color: #7f7f7f;">)))</span> 
         {}
         <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">mapcat</span> (fn [x]
                   <span style="color: #7f7f7f;">(</span><span style="color: #FBDE2D;">let</span> [[k v] x]
                     <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">mapcat</span> (fn [x]
                               <span style="color: #7f7f7f;">(</span><span style="color: #FBDE2D;">let</span> [[kin vin] x]
                                 {[k kin] vin}
                                 <span style="color: #7f7f7f;">))</span> 
                             v<span style="color: #7f7f7f;">)))</span>
                 %<span style="color: #7f7f7f;">))</span>

 <span style="color: #8B8989; font-style: italic;">;;</span><span style="color: #8B8989; font-style: italic;">153</span>
 (fn __ [coll]
   <span style="color: #7f7f7f;">(</span><span style="color: #FBDE2D;">let</span> [x <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">mapcat</span> #<span style="color: #7f7f7f;">(</span>(fn [t] <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">mapcat</span> (fn [y] <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">list</span> y<span style="color: #7f7f7f;">))</span> t<span style="color: #7f7f7f;">))</span> %<span style="color: #7f7f7f;">)</span> coll<span style="color: #7f7f7f;">)</span>]
             <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">=</span> 0 <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">count</span> <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">filter</span> #<span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">&gt;</span> % 1<span style="color: #7f7f7f;">)</span> <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">mapcat</span> #<span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">list</span> <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">count</span> <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">filter</span> <span style="color: #7f7f7f;">(</span>(fn [a] (fn [b] <span style="color: #7f7f7f;">(</span><span style="color: #FF6400;">=</span> a b<span style="color: #7f7f7f;">)))</span>

                                                                %<span style="color: #7f7f7f;">)</span> x<span style="color: #7f7f7f;">)))</span> x <span style="color: #7f7f7f;">))))</span> 
    <span style="color: #7f7f7f;">))</span>

<span style="color: #8B8989; font-style: italic;">;;</span><span style="color: #8B8989; font-style: italic;">173</span>
op n
</pre>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Jian Qin</p>
<p class="date">Created: 2013-08-15 四 17:11</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.2.1 (<a href="http://orgmode.org">Org</a> mode 8.0.7)</p>
<p class="xhtml-validation"><a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a></p>
</div>
</body>
</html>
